[
  {
    "q": "How do I book an appointment?",
    "a": "Online booking will open soon. Join the email list to be notified and access launch‑week perks."
  },
  {
    "q": "Where are you located?",
    "a": "We're located in Fort Lauderdale, FL, and we service all of South Florida. Parking is available on-site. Hours are by appointment only—check the scheduler for availability."
  },
  {
    "q": "What is your cancellation policy?",
    "a": "Cancellations made 72+ hours before your appointment receive a full refund (minus processing fee). Cancellations within 48–72 hours receive a 50% refund. Cancellations within 24 hours receive no refund, but you'll receive 25% off your next service (up to 50% of the cancelled service value). No-shows are treated the same as 24-hour cancellations. If you arrive late, your appointment time may be shortened depending on schedule availability."
  },
  {
    "q": "I'm on acne medication—can I be treated?",
    "a": "Some services are not appropriate while using isotretinoin or certain topicals. Please share your current routine and medications during intake—Amy will advise safe options."
  },
  {
    "q": "Which facial is right for me?",
    "a": "Start with the Signature Aura Facial; we'll customize based on your skin and goals."
  },
  {
    "q": "Do you offer extractions?",
    "a": "Yes, when appropriate and always gently to respect the skin barrier."
  },
  {
    "q": "Are treatments pregnancy‑safe?",
    "a": "Many are. Please mention pregnancy during intake so we can tailor products and modalities."
  },
  {
    "q": "Do you sell skincare?",
    "a": "Curated home‑care recommendations are provided post‑service; retail offerings will be listed at launch."
  },
  {
    "q": "Do you accept gratuity?",
    "a": "Gratuity is appreciated but never expected. Digital options will be available in‑studio."
  },
  {
    "q": "Accessibility & sensitivities",
    "a": "Please tell us about fragrance sensitivities or accessibility needs—our studio aims to accommodate."
  }
]

